scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
void updateProbeResult(SupervisorProbeState& probe, bool healthy, int statusCode, const String& errorText) {
    probe.healthy = healthy;
    probe.lastStatusCode = statusCode;
    probe.lastCheckMs = millis();
    probe.lastError = errorText;
    if (healthy) probe.okCount++;
    else probe.failCount++;
}

void probeHttpTarget(SupervisorProbeState& probe) {
    if (probe.url.length() == 0) {
        updateProbeResult(probe, false, -1, "probe url not configured");
        return;
    }

    if (WiFi.status() != WL_CONNECTED) {
        updateProbeResult(probe, false, -1, "wifi disconnected");
        return;
    }

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient probeClient;
    if (!http.begin(probeClient, probe.url)) {
#else
    if (!http.begin(probe.url)) {
#endif
        updateProbeResult(probe, false, -1, "http begin failed");
        return;
    }

    http.setTimeout(2500);
    const int code = http.GET();
    const bool ok = code >= 200 && code < 500;
    String err;
    if (!ok) {
        err = String("http code ") + String(code);
    }
    updateProbeResult(probe, ok, code, err);
    http.end();
}

bool parseUrlHostPort(const String& url, String& hostOut, uint16_t& portOut) {
    const int schemeSep = url.indexOf("://");
    const int hostStart = schemeSep >= 0 ? schemeSep + 3 : 0;
    const int pathStart = url.indexOf('/', hostStart);
    const String hostPort = pathStart >= 0 ? url.substring(hostStart, pathStart) : url.substring(hostStart);
    if (hostPort.length() == 0) {
        return false;
    }

    const int colon = hostPort.lastIndexOf(':');
    if (colon > 0) {
        hostOut = hostPort.substring(0, colon);
        const int parsedPort = hostPort.substring(colon + 1).toInt();
        if (parsedPort <= 0 || parsedPort > 65535) {
            return false;
        }
        portOut = static_cast<uint16_t>(parsedPort);
        return true;
    }

    hostOut = hostPort;
    if (schemeSep >= 0 && url.substring(0, schemeSep).equalsIgnoreCase("https")) {
        portOut = 443;
    } else {
        portOut = 80;
    }
    return true;
}

void probeTcpTarget(SupervisorProbeState& probe) {
    if (probe.url.length() == 0) {
        updateProbeResult(probe, false, -1, "probe url not configured");
        return;
    }

    if (WiFi.status() != WL_CONNECTED) {
        updateProbeResult(probe, false, -1, "wifi disconnected");
        return;
    }

    String host;
    uint16_t port = 0;
    if (!parseUrlHostPort(probe.url, host, port)) {
        updateProbeResult(probe, false, -1, "invalid probe url");
        return;
    }

    WiFiClient client;
    client.setTimeout(2500);
    const bool ok = client.connect(host.c_str(), port);
    if (ok) {
        updateProbeResult(probe, true, 200, "");
        client.stop();
        return;
    }

    updateProbeResult(probe, false, -11, "tcp connect failed");
}

void postSupervisorHeartbeat() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return;
    }

    if (supervisorHeartbeatUrl.length() == 0) {
        return;
    }

    if (WiFi.status() != WL_CONNECTED) {
        supervisorLastHeartbeatStatusCode = -1;
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = "wifi disconnected";
        return;
    }

    JsonDocument doc;
    doc["nodeId"] = nodeName;
    doc["nodeName"] = nodeName;
    doc["ip"] = WiFi.localIP().toString();
    doc["deviceRole"] = deviceRole;
    doc["overallHealthy"] = supervisorOverallHealthy();

    auto supervisor = doc["supervisor"].to<JsonObject>();
    appendSupervisorStatus(supervisor);

    String body;
    serializeJson(doc, body);

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient supervisorClient;
    if (!http.begin(supervisorClient, supervisorHeartbeatUrl)) {
#else
    if (!http.begin(supervisorHeartbeatUrl)) {
#endif
        supervisorLastHeartbeatStatusCode = -1;
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = "heartbeat begin failed";
        return;
    }

    http.addHeader("Content-Type", "application/json");
    http.setTimeout(2500);
    const int code = http.POST((uint8_t*)body.c_str(), body.length());
    supervisorLastHeartbeatPostMs = millis();
    supervisorLastHeartbeatStatusCode = code;

    if (code >= 200 && code < 300) {
        supervisorHeartbeatOkCount++;
        supervisorLastHeartbeatError = "";
    } else {
        supervisorHeartbeatFailCount++;
        supervisorLastHeartbeatError = String("http code ") + String(code);
    }

    http.end();
}

void runSupervisorHealthChecks() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return;
    }

    const unsigned long now = millis();
    if (now - supervisorLastRunMs < supervisorCheckIntervalMs) {
        return;
    }
    supervisorLastRunMs = now;

    probeHttpTarget(supervisorBackendProbe);
    probeTcpTarget(supervisorFrontendProbe);
    postSupervisorHeartbeat();
}

bool supervisorOverallHealthy() {
    if (!isSupervisorRole() || !supervisorEnabled) {
        return true;
    }
    if (!supervisorBackendProbe.healthy) {
        return false;
    }
    if (!supervisorRequireFrontend) {
        return true;
    }
    return supervisorFrontendProbe.healthy;
}

void appendSupervisorStatus(JsonObject obj) {
    obj["enabled"] = supervisorEnabled;
    obj["checkIntervalMs"] = static_cast<uint32_t>(supervisorCheckIntervalMs);
    obj["lastRunMs"] = static_cast<uint32_t>(supervisorLastRunMs);
    obj["overallHealthy"] = supervisorOverallHealthy();
    obj["requireFrontend"] = supervisorRequireFrontend;
    obj["heartbeatUrl"] = supervisorHeartbeatUrl;
    obj["lastHeartbeatStatusCode"] = supervisorLastHeartbeatStatusCode;
    obj["lastHeartbeatPostMs"] = static_cast<uint32_t>(supervisorLastHeartbeatPostMs);
    obj["heartbeatOkCount"] = static_cast<uint32_t>(supervisorHeartbeatOkCount);
    obj["heartbeatFailCount"] = static_cast<uint32_t>(supervisorHeartbeatFailCount);
    obj["lastHeartbeatError"] = supervisorLastHeartbeatError;

