scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    auto targets = obj["targets"].to<JsonArray>();

    auto b = targets.add<JsonObject>();
    b["name"] = supervisorBackendProbe.name;
    b["url"] = supervisorBackendProbe.url;
    b["healthy"] = supervisorBackendProbe.healthy;
    b["lastStatusCode"] = supervisorBackendProbe.lastStatusCode;
    b["lastCheckMs"] = static_cast<uint32_t>(supervisorBackendProbe.lastCheckMs);
    b["okCount"] = static_cast<uint32_t>(supervisorBackendProbe.okCount);
    b["failCount"] = static_cast<uint32_t>(supervisorBackendProbe.failCount);
    b["lastError"] = supervisorBackendProbe.lastError;

    auto f = targets.add<JsonObject>();
    f["name"] = supervisorFrontendProbe.name;
    f["url"] = supervisorFrontendProbe.url;
    f["healthy"] = supervisorFrontendProbe.healthy;
    f["lastStatusCode"] = supervisorFrontendProbe.lastStatusCode;
    f["lastCheckMs"] = static_cast<uint32_t>(supervisorFrontendProbe.lastCheckMs);
    f["okCount"] = static_cast<uint32_t>(supervisorFrontendProbe.okCount);
    f["failCount"] = static_cast<uint32_t>(supervisorFrontendProbe.failCount);
    f["lastError"] = supervisorFrontendProbe.lastError;
}

struct BonecrusherWorkerConfig {
    bool enabled = false;
    String queueManagerUrl = "http://192.168.2.11:4100";
    String queueName = "swift.mt103.inbound";
    String workerId = "";
    uint32_t leaseMs = 30000;
    uint32_t pollIntervalMs = 250;
    uint32_t heartbeatMs = 4000;
    uint32_t processTimeoutMs = 60000;
    uint32_t retryDelayMs = 1000;
    uint32_t maxAttempts = 5;
};

struct BonecrusherWorkerStats {
    uint32_t claimAttempts = 0;
    uint32_t claimed = 0;
    uint32_t completed = 0;
    uint32_t failed = 0;
    uint32_t requeued = 0;
    uint32_t deadLettered = 0;
    uint32_t heartbeatsSent = 0;
    int lastQueueHttpCode = 0;
    int lastEdgeHttpCode = 0;
    unsigned long lastRunMs = 0;
    String lastError;
};

BonecrusherWorkerConfig bonecrusherConfig;
BonecrusherWorkerStats bonecrusherStats;
const char* bonecrusherConfigPath = "/bonecrusher-worker-config.json";
#if defined(ESP32)
TaskHandle_t bonecrusherWorkerTaskHandle = nullptr;
#endif

bool isBonecrusherRole() {
    const String role = String(deviceRole);
    return role.equalsIgnoreCase("bonecrusher") || role.equalsIgnoreCase("generalist");
}

String percentEncode(const String& in) {
    String out;
    out.reserve(in.length() * 3);
    for (size_t i = 0; i < in.length(); ++i) {
        const uint8_t c = static_cast<uint8_t>(in[i]);
        const bool unreserved =
            (c >= 'A' && c <= 'Z') ||
            (c >= 'a' && c <= 'z') ||
            (c >= '0' && c <= '9') ||
            c == '-' || c == '_' || c == '.' || c == '~';
        if (unreserved) {
            out += static_cast<char>(c);
            continue;
        }
        char buf[4];
        snprintf(buf, sizeof(buf), "%%%02X", c);
        out += buf;
    }
    return out;
}

String trimTrailingSlash(const String& value) {
    String out = value;
    while (out.endsWith("/")) {
        out.remove(out.length() - 1);
    }
    return out;
}

void initializeBonecrusherWorkerDefaults() {
    bonecrusherConfig.enabled = isBonecrusherRole();
    bonecrusherConfig.workerId = nodeName.length() > 0 ? nodeName : "bonecrusher-worker";
}

void saveBonecrusherWorkerConfig() {
    JsonDocument doc;
    doc["enabled"] = bonecrusherConfig.enabled;
    doc["queueManagerUrl"] = bonecrusherConfig.queueManagerUrl;
    doc["queueName"] = bonecrusherConfig.queueName;
    doc["workerId"] = bonecrusherConfig.workerId;
    doc["leaseMs"] = bonecrusherConfig.leaseMs;
    doc["pollIntervalMs"] = bonecrusherConfig.pollIntervalMs;
    doc["heartbeatMs"] = bonecrusherConfig.heartbeatMs;
    doc["processTimeoutMs"] = bonecrusherConfig.processTimeoutMs;
    doc["retryDelayMs"] = bonecrusherConfig.retryDelayMs;
    doc["maxAttempts"] = bonecrusherConfig.maxAttempts;

    File f = LittleFS.open(bonecrusherConfigPath, "w");
    if (!f) {
        Serial.println("[BONECRUSHER] Failed to save worker config");
        return;
    }
    serializeJson(doc, f);
    f.close();
}

void loadBonecrusherWorkerConfig() {
    if (!LittleFS.exists(bonecrusherConfigPath)) return;

    File f = LittleFS.open(bonecrusherConfigPath, "r");
    if (!f) return;

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
        Serial.println("[BONECRUSHER] Failed to parse worker config, using defaults");
        return;
    }

    if (doc["enabled"].is<bool>()) bonecrusherConfig.enabled = doc["enabled"].as<bool>();
    if (doc["queueManagerUrl"].is<const char*>()) bonecrusherConfig.queueManagerUrl = doc["queueManagerUrl"].as<const char*>();
    if (doc["queueName"].is<const char*>()) bonecrusherConfig.queueName = doc["queueName"].as<const char*>();
    if (doc["workerId"].is<const char*>()) bonecrusherConfig.workerId = doc["workerId"].as<const char*>();
    if (doc["leaseMs"].is<uint32_t>()) bonecrusherConfig.leaseMs = doc["leaseMs"].as<uint32_t>();
    if (doc["pollIntervalMs"].is<uint32_t>()) bonecrusherConfig.pollIntervalMs = doc["pollIntervalMs"].as<uint32_t>();
    if (doc["heartbeatMs"].is<uint32_t>()) bonecrusherConfig.heartbeatMs = doc["heartbeatMs"].as<uint32_t>();
    if (doc["processTimeoutMs"].is<uint32_t>()) bonecrusherConfig.processTimeoutMs = doc["processTimeoutMs"].as<uint32_t>();
    if (doc["retryDelayMs"].is<uint32_t>()) bonecrusherConfig.retryDelayMs = doc["retryDelayMs"].as<uint32_t>();
    if (doc["maxAttempts"].is<uint32_t>()) bonecrusherConfig.maxAttempts = doc["maxAttempts"].as<uint32_t>();
}

int httpPostJson(const String& url, const String& body, String& responseBody, uint16_t timeoutMs = 4000) {
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient postJsonClient;
    if (!http.begin(postJsonClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.addHeader("Content-Type", "application/json");
    http.setTimeout(timeoutMs);
    const int code = http.POST(body);
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
    return code;
}

