scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    auto handleLedAction = [](AsyncWebServerRequest *request){
        String action;
        if (request->hasParam("action", true)) {
            action = request->getParam("action", true)->value();
        } else if (request->hasParam("action")) {
            action = request->getParam("action")->value();
        }
        action.trim();
        if (action.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"action is required\"}");
            return;
        }

        const int ledPinNumber = 2;
        String valueParam;
        if (request->hasParam("value", true)) {
            valueParam = request->getParam("value", true)->value();
        } else if (request->hasParam("value")) {
            valueParam = request->getParam("value")->value();
        }
        valueParam.trim();

        Serial.printf("[LEDPIN] Received action=%s value=%s\n", action.c_str(), valueParam.c_str());

        // Always configure the LED pin as output before any state change.
        pinMode(ledPinNumber, OUTPUT);

        bool nextOn = false;
        if (action.equalsIgnoreCase("raise") || action.equalsIgnoreCase("turnOn") || action.equalsIgnoreCase("on")) {
            nextOn = true;
        } else if (action.equalsIgnoreCase("lower") || action.equalsIgnoreCase("turnOff") || action.equalsIgnoreCase("off")) {
            nextOn = false;
        } else if (action.equalsIgnoreCase("set_output")) {
            const String lowered = valueParam;
            if (lowered.equalsIgnoreCase("1") || lowered.equalsIgnoreCase("high") || lowered.equalsIgnoreCase("on") || lowered.equalsIgnoreCase("true")) {
                nextOn = true;
            } else if (lowered.equalsIgnoreCase("0") || lowered.equalsIgnoreCase("low") || lowered.equalsIgnoreCase("off") || lowered.equalsIgnoreCase("false")) {
                nextOn = false;
            } else {
                request->send(400, "application/json", "{\"error\":\"set_output requires value=0|1|low|high|off|on|false|true\"}");
                return;
            }
        } else {
            request->send(400, "application/json", "{\"error\":\"unsupported LED action\"}");
            return;
        }

        digitalWrite(ledPinNumber, nextOn ? HIGH : LOW);
        Serial.printf("[LEDPIN] Pin %d set to %s\n", ledPinNumber, nextOn ? "HIGH" : "LOW");

        JsonDocument doc;
        doc["status"] = "ok";
        doc["device"] = "LEDPIN";
        doc["action"] = action;
        doc["pin"] = ledPinNumber;
        doc["state"] = nextOn ? "on" : "off";
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    };

    server.on("/devices/ledpin/action", HTTP_POST, handleLedAction);
    server.on("/devices/LEDPIN/action", HTTP_POST, handleLedAction);

    // Self-describing services endpoint
    server.on("/services/describe", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        #if defined(ESP32)
        doc["hardware"] = "ESP32";
        #elif defined(ESP8266)
        doc["hardware"] = "ESP8266";
        #else
        doc["hardware"] = "Unknown";
        #endif
        doc["nodeName"] = nodeName;
        doc["firmwareVersion"] = firmwareVersion;
        doc["deviceRole"] = deviceRole;
        doc["preferredTaskType"] = preferredTaskType;
        doc["firmwareTrack"] = firmwareTrack;
        doc["otaEnabled"] = otaEnabled;
        doc["maxMessageBytes"] = static_cast<uint32_t>(maxMessageBytes);
        doc["maxConcurrentTasks"] = static_cast<uint32_t>(maxConcurrentTasks);
        auto cluster = doc["cluster"].to<JsonObject>();
        cluster["activeClusterId"] = nodeConfig.activeClusterId;
        cluster["parentHost"] = nodeConfig.parentHost;
        cluster["parentNodeId"] = nodeConfig.parentNodeId;
        cluster["isClusterGateway"] = nodeConfig.isClusterGateway;
        cluster["parentPort"] = nodeConfig.parentPort;
        cluster["siblingPort"] = nodeConfig.siblingPort;
        auto services = doc["services"].to<JsonArray>();

        if (isSupervisorRole()) {
            auto supervisor = services.add<JsonObject>();
            supervisor["name"] = "StartupSupervisor";
            supervisor["description"] = "Monitors backend/frontend readiness and exposes stability telemetry.";
            supervisor["status"] = supervisorOverallHealthy() ? "healthy" : "degraded";
            auto supervisorCmds = supervisor["commands"].to<JsonArray>();
            JsonObject c1 = supervisorCmds.add<JsonObject>();
            c1["name"] = "status";
            c1["description"] = "GET /supervisor/status returns health telemetry.";
            JsonObject c2 = supervisorCmds.add<JsonObject>();
            c2["name"] = "configure";
            c2["description"] = "POST /supervisor/config to update enabled flag, interval, and probe URLs.";
        }

        // Devices section: enumerate devices and their documentation/visibility
        JsonArray devices = doc["devices"].to<JsonArray>();
        if (LittleFS.exists("/devices")) {
            File dir = LittleFS.open("/devices", "r");
            File entry = dir.openNextFile();
            while (entry) {
                if (entry.isDirectory()) {
                    entry = dir.openNextFile();
                    continue;
                }
                String devName = String(entry.name());
                if (devName.startsWith("/devices/")) devName = devName.substring(9);
                if (!devName.endsWith(".json")) {
                    entry.close();
                    entry = dir.openNextFile();
                    continue;
                }
                if (devName.endsWith(".json")) devName = devName.substring(0, devName.length() - 5);
                // Read device JSON
                String devJsonStr = entry.readString();
                entry.close();
                JsonDocument devDoc;
                DeserializationError err = deserializeJson(devDoc, devJsonStr);
                JsonObject devObj = devices.add<JsonObject>();
                devObj["name"] = devName;
                // Visibility: default private, can be set to public in device JSON
                String visibility = "private";
                if (!err && devDoc["visibility"].is<const char*>()) {
                    visibility = devDoc["visibility"].as<String>();
                }
                devObj["visibility"] = visibility;
                // Load documentation from FFS if available
                String docText;
                String docPath = String("/devices/docs/") + devName + ".txt";
                File docFile = LittleFS.open(docPath, "r");
                if (docFile) {
                    docText = docFile.readString();
                    docFile.close();
                } else {
                    docText = String("Device: ") + devName;
                }
                devObj["description"] = docText;
                // Optionally, add device actions/commands if present in JSON
                if (!err && devDoc["actions"].is<JsonArray>()) {
                    JsonArray actions = devObj["actions"].to<JsonArray>();
                    for (JsonVariant v : devDoc["actions"].as<JsonArray>()) {
                        String actionName = v.as<String>();
                        String actionDocPath = String("/devices/docs/") + devName + "_" + actionName + ".txt";
                        String actionDoc;
                        File actionDocFile = LittleFS.open(actionDocPath, "r");
                        if (actionDocFile) { actionDoc = actionDocFile.readString(); actionDocFile.close(); }
                        else { actionDoc = String("Action: ") + actionName; }
                        JsonObject act = actions.add<JsonObject>();
                        act["name"] = actionName;
                        act["description"] = actionDoc;
                    }
                }
                entry = dir.openNextFile();
            }
        }

        // FFS Service
        auto ffs = services.add<JsonObject>();
        ffs["name"] = "FFS";
        {
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs.txt", "r");
            if (docFile) {
                docText = docFile.readString();
                docFile.close();
            } else {
                docText = "Federated File System: provides distributed file storage and access.";
            }
            ffs["description"] = docText;
        }
        // Check if broker has marked this service busy
        extern std::map<String, bool> serviceBusyMap;
        String ffsStatus = ffsUp ? "up" : "down";
        if (serviceBusyMap.count("FFS") && serviceBusyMap["FFS"]) ffsStatus = "busy";
        ffs["status"] = ffsStatus;
        auto ffsCmds = ffs["commands"].to<JsonArray>();
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "listFiles";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_listFiles.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "List all files in the file system."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "write";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_write.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Write data to a file."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "read";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_read.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Read data from a file."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "remove";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_remove.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Remove a file from the file system."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "sync";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_sync.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Synchronize file system to storage."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "mount";
            cmd["description"] = "Create a mount point that aliases a local path or points at a peer node.";
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "unmount";
            cmd["description"] = "Remove a previously configured mount point.";
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "mounts";
            cmd["description"] = "List configured mount points.";
        }

