scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        // PMachine Service
        #ifdef ENABLE_PMACHINE
        extern pmachine::PMachine pm;
        auto pmObj = services.add<JsonObject>();
        pmObj["name"] = "pmachine";
        {
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine.txt", "r");
            if (docFile) {
                docText = docFile.readString();
                docFile.close();
            } else {
                docText = "PL/0-style virtual machine for executing pcode programs.";
            }
            pmObj["description"] = docText;
        }
        auto s = pm.getStatus();
        String pmStatus = s.running ? "running" : "stopped";
        if (serviceBusyMap.count("pmachine") && serviceBusyMap["pmachine"]) pmStatus = "busy";
        pmObj["status"] = pmStatus;
        auto pmCmds = pmObj["commands"].to<JsonArray>();
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "loadProgram";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_loadProgram.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Load a pcode program into the VM."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "run";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_run.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Run the loaded program."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "singleStep";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_singleStep.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Execute a single instruction."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "setBreakpoint";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_setBreakpoint.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Set a breakpoint at a given address."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "clearBreakpoint";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_clearBreakpoint.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Clear a breakpoint at a given address."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = pmCmds.add<JsonObject>();
            cmd["name"] = "getStatus";
            String docText;
            File docFile = LittleFS.open("/services/docs/pmachine_getStatus.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Get the current status of the VM."; }
            cmd["description"] = docText;
        }

        auto routerObj = services.add<JsonObject>();
        routerObj["name"] = "GenericRouterService";
        routerObj["description"] = "Aggregator-compatible generic router: FFS-distributed rules and mapping execution.";
        String routerStatus = "ready";
        if (serviceBusyMap.count("GenericRouterService") && serviceBusyMap["GenericRouterService"]) routerStatus = "busy";
        routerObj["status"] = routerStatus;
        auto routerCmds = routerObj["commands"].to<JsonArray>();
        {
            JsonObject cmd = routerCmds.add<JsonObject>();
            cmd["name"] = "run";
            cmd["description"] = "Run routing rules for an input queue and payload.";
        }
        {
            JsonObject cmd = routerCmds.add<JsonObject>();
            cmd["name"] = "runWithMappings";
            cmd["description"] = "Run routing including MAP(...) transforms using distributed mapping files.";
        }
        #endif

        #ifdef ENABLE_BLUETOOTH_DEVICES
        auto btObj = services.add<JsonObject>();
        btObj["name"] = "BluetoothService";
        btObj["description"] = "Bluetooth LE discovery and generic device control service.";
        String btStatus = (globalBluetoothService != nullptr) ? "ready" : "down";
        if (serviceBusyMap.count("BluetoothService") && serviceBusyMap["BluetoothService"]) btStatus = "busy";
        btObj["status"] = btStatus;
        auto btCmds = btObj["commands"].to<JsonArray>();
        {
            JsonObject cmd = btCmds.add<JsonObject>();
            cmd["name"] = "discoverDevices";
            cmd["description"] = "POST /api/bluetooth/scan then GET /api/bluetooth/devices.";
        }
        {
            JsonObject cmd = btCmds.add<JsonObject>();
            cmd["name"] = "connectDevice";
            cmd["description"] = "POST /api/bluetooth/connect with target address.";
        }

        #if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
        auto btAudioObj = services.add<JsonObject>();
        btAudioObj["name"] = "BluetoothAudioTtsService";
        btAudioObj["description"] = "Find speakers/headsets, connect target, queue MP3 playback, and invoke TTS.";
        String btAudioStatus = (globalBluetoothAudioTtsService != nullptr) ? "ready" : "down";
        if (serviceBusyMap.count("BluetoothAudioTtsService") && serviceBusyMap["BluetoothAudioTtsService"]) btAudioStatus = "busy";
        btAudioObj["status"] = btAudioStatus;
        auto btAudioCmds = btAudioObj["commands"].to<JsonArray>();
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "discover";
            cmd["description"] = "POST /api/bluetooth-audio/discover";
        }
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "listTargets";
            cmd["description"] = "GET /api/bluetooth-audio/targets";
        }
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "connect";
            cmd["description"] = "POST /api/bluetooth-audio/connect";
        }
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "playMp3";
            cmd["description"] = "POST /api/bluetooth-audio/play-mp3";
        }
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "tts";
            cmd["description"] = "POST /api/bluetooth-audio/tts";
        }
        {
            JsonObject cmd = btAudioCmds.add<JsonObject>();
            cmd["name"] = "ui";
            cmd["description"] = "GET /BTConnect serves the bluetooth connect web UI.";
        }
        #endif
        #endif

