scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        // Sensor Service (example, static)
        auto sensor = services.add<JsonObject>();
        sensor["name"] = "SensorService";
        {
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor.txt", "r");
            if (docFile) {
                docText = docFile.readString();
                docFile.close();
            } else {
                docText = "Provides access to connected sensors (e.g., DHT22, BME280).";
            }
            sensor["description"] = docText;
        }
        String sensorStatus = "ready";
        if (serviceBusyMap.count("SensorService") && serviceBusyMap["SensorService"]) sensorStatus = "busy";
        sensor["status"] = sensorStatus;
        auto sensorCmds = sensor["commands"].to<JsonArray>();
        {
            JsonObject cmd = sensorCmds.add<JsonObject>();
            cmd["name"] = "readSensor";
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor_readSensor.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Read values from a sensor."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = sensorCmds.add<JsonObject>();
            cmd["name"] = "resultToJson";
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor_resultToJson.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Convert sensor result to JSON."; }
            cmd["description"] = docText;
        }

#ifdef ENABLE_TIME_AUTHORITY
        auto timeAuthority = services.add<JsonObject>();
        timeAuthority["name"] = "TimeAuthorityService";
        timeAuthority["description"] = "Authoritative time service with NTP sync and cooperative peer checks.";
        String timeAuthorityStatus = "ready";
        if (serviceBusyMap.count("TimeAuthorityService") && serviceBusyMap["TimeAuthorityService"]) timeAuthorityStatus = "busy";
        timeAuthority["status"] = timeAuthorityStatus;
        auto timeCmds = timeAuthority["commands"].to<JsonArray>();
        {
            JsonObject cmd = timeCmds.add<JsonObject>();
            cmd["name"] = "status";
            cmd["description"] = "GET /time/authority returns current authority time snapshot.";
        }
        {
            JsonObject cmd = timeCmds.add<JsonObject>();
            cmd["name"] = "resync";
            cmd["description"] = "POST /time/authority/sync forces immediate NTP resync.";
        }
#endif

#ifndef DISABLE_UNIQUE_ID_SERVICE
        auto uniqueId = services.add<JsonObject>();
        uniqueId["name"] = "UniqueIdService";
        uniqueId["description"] = "Hybrid unique ID service (hashed MAC + time + counter + random).";
        String uniqueIdStatus = "ready";
        if (serviceBusyMap.count("UniqueIdService") && serviceBusyMap["UniqueIdService"]) uniqueIdStatus = "busy";
        uniqueId["status"] = uniqueIdStatus;
        auto uniqueIdCmds = uniqueId["commands"].to<JsonArray>();
        {
            JsonObject cmd = uniqueIdCmds.add<JsonObject>();
            cmd["name"] = "device";
            cmd["description"] = "GET /id/device returns stable device identity metadata.";
        }
        {
            JsonObject cmd = uniqueIdCmds.add<JsonObject>();
            cmd["name"] = "next";
            cmd["description"] = "POST or GET /id/next returns a new globally unique event ID.";
        }
        {
            JsonObject cmd = uniqueIdCmds.add<JsonObject>();
            cmd["name"] = "status";
            cmd["description"] = "GET /id/status returns unique ID service health and counters.";
        }
#endif

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    // GET /sensor/read?pin=4&type=DHT22&unit=C
    server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request){
        const uint32_t freeHeap = ESP.getFreeHeap();
        if (freeHeap < 70000) {
            char fallback[256];
            snprintf(
                fallback,
                sizeof(fallback),
                "{\"status\":\"degraded\",\"error\":\"low_heap\",\"freeHeap\":%lu,\"nodeName\":\"%s\",\"ip\":\"%s\"}",
                static_cast<unsigned long>(freeHeap),
                nodeName.c_str(),
                WiFi.localIP().toString().c_str());
            request->send(200, "application/json", fallback);
            return;
        }

        const size_t maxDiscoveredNodesInStatus = 64;
        const size_t estimatedNodeBytes = 80;
        String json;
        const size_t reserveBytes = 2200 + (std::min(discoveredNodeTable.size(), maxDiscoveredNodesInStatus) * estimatedNodeBytes);
        if (!json.reserve(reserveBytes)) {
            char fallback[256];
            snprintf(
                fallback,
                sizeof(fallback),
                "{\"status\":\"degraded\",\"error\":\"reserve_failed\",\"freeHeap\":%lu,\"nodeName\":\"%s\",\"ip\":\"%s\"}",
                static_cast<unsigned long>(ESP.getFreeHeap()),
                nodeName.c_str(),
                WiFi.localIP().toString().c_str());
            request->send(200, "application/json", fallback);
            return;
        }

        json = "{";
        #if defined(ESP32)
            File dir = LittleFS.open("/devices", "r");
        #elif defined(ESP8266)
        json += "\"hardware\":\"ESP8266\",";
        #endif
        json += "\"nodeName\":\"" + nodeName + "\",";
        json += "\"firmwareVersion\":\"" + String(firmwareVersion) + "\",";
        json += "\"deviceRole\":\"" + String(deviceRole) + "\",";
        json += "\"preferredTaskType\":\"" + String(preferredTaskType) + "\",";
        json += "\"firmwareTrack\":\"" + String(firmwareTrack) + "\",";
        json += String("\"otaEnabled\":") + (otaEnabled ? "true" : "false") + ",";
        json += "\"maxMessageBytes\":" + String((unsigned long)maxMessageBytes) + ",";
        json += "\"maxConcurrentTasks\":" + String((unsigned long)maxConcurrentTasks) + ",";
        json += "\"cluster\":{";
        json += "\"activeClusterId\":\"" + String(nodeConfig.activeClusterId) + "\",";
        json += "\"parentHost\":\"" + String(nodeConfig.parentHost) + "\",";
        json += "\"parentNodeId\":\"" + String(nodeConfig.parentNodeId) + "\",";
        json += String("\"isClusterGateway\":") + (nodeConfig.isClusterGateway ? "true" : "false") + ",";
        json += "\"parentPort\":" + String((unsigned long)nodeConfig.parentPort) + ",";
        json += "\"siblingPort\":" + String((unsigned long)nodeConfig.siblingPort);
        json += "},";
        json += "\"beacon\":{";
        json += String("\"acknowledged\":") + (udpRuntimeIsBeaconAcknowledged() ? "true" : "false") + ",";
        json += "\"lastSentAt\":" + String((unsigned long)udpRuntimeGetBeaconLastSentAt()) + ",";
        json += "\"lastAckAt\":" + String((unsigned long)udpRuntimeGetBeaconLastAckAt()) + ",";
        json += "\"capabilityHash\":\"" + computeNodeCapabilityHash() + "\"}" + ",";
        if (isSupervisorRole()) {
            json += String("\"supervisorEnabled\":") + (supervisorEnabled ? "true" : "false") + ",";
            json += String("\"supervisorOverallHealthy\":") + (supervisorOverallHealthy() ? "true" : "false") + ",";
        }
        json += "\"services\":[";
        bool firstService = true;
        if (isSupervisorRole()) {
            json += "\"StartupSupervisor\"";
            firstService = false;
        }
        if (ffsUp) {
            if (!firstService) json += ",";
            json += "\"FFS\"";
            firstService = false;
        }
        #ifdef ENABLE_PMACHINE
        if (!firstService) json += ",";
        #ifndef DISABLE_PMACHINE_ROUTES
        json += "\"pmachine\"";
        json += ",\"GenericRouterService\"";
        firstService = false;
        #endif
        #endif
        #ifdef ENABLE_BLUETOOTH_DEVICES
        if (!firstService) json += ",";
        json += "\"BluetoothService\"";
        firstService = false;
        #if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
            if (!firstService) json += ",";
            json += "\"BluetoothAudioTtsService\"";
            firstService = false;
        #endif
        #endif
        #ifdef ENABLE_EVENT_SCHEDULER
        if (!firstService) json += ",";
        json += "\"EventSchedulerService\"";
        firstService = false;
        #endif
        #ifdef ENABLE_TIME_AUTHORITY
        if (!firstService) json += ",";
        json += "\"TimeAuthorityService\"";
        firstService = false;
        #endif
    #ifndef DISABLE_UNIQUE_ID_SERVICE
        if (!firstService) json += ",";
        json += "\"UniqueIdService\"";
        firstService = false;
    #endif
        json += "]";
        json += ",\"discoveredNodes\":[";
        bool first = true;
        size_t emittedNodes = 0;
        for (const auto& pair : discoveredNodeTable) {
            if (emittedNodes >= maxDiscoveredNodesInStatus) {
                break;
            }
            if (!first) json += ",";
            json += "{\"mac\":\"" + pair.second.mac + "\",\"ip\":\"" + pair.second.ip + "\"}";
            first = false;
            emittedNodes++;
        }
        json += "]";
        json += ",\"discoveredNodeCount\":" + String((unsigned long)discoveredNodeTable.size());
        json += ",\"discoveredNodesTruncated\":";
        json += (discoveredNodeTable.size() > emittedNodes) ? "true" : "false";
#ifdef ENABLE_TIME_AUTHORITY
        json += ",\"timeAuthority\":";
        json += timeAuthorityBuildStatusJson();
#endif
#ifndef DISABLE_UNIQUE_ID_SERVICE
    json += ",\"uniqueId\":";
    json += uniqueIdBuildStatusJson();
#endif
        json += "}";
        request->send(200, "application/json", json);
    });

#ifdef ENABLE_TIME_AUTHORITY
    server.on("/time/authority", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send(200, "application/json", timeAuthorityBuildStatusJson());
    });

    server.on("/time/authority/sync", HTTP_POST, [](AsyncWebServerRequest *request){
        const bool ok = timeAuthorityForceResync("api");
        const String body = String("{\"status\":\"") + (ok ? "ok" : "degraded") + "\",\"time\":" + timeAuthorityBuildStatusJson() + "}";
        request->send(ok ? 200 : 503, "application/json", body);
    });
#endif

#ifndef DISABLE_UNIQUE_ID_SERVICE
    auto handleUniqueIdNext = [](AsyncWebServerRequest *request) {
        String kind = "evt";
        if (request->hasParam("kind", true)) {
            kind = request->getParam("kind", true)->value();
        } else if (request->hasParam("kind")) {
            kind = request->getParam("kind")->value();
        }
        kind.trim();
        if (kind.length() == 0) {
            kind = "evt";
        }

        const String nextId = uniqueIdNext(kind);
        JsonDocument doc;
        doc["status"] = "ok";
        doc["kind"] = kind;
        doc["id"] = nextId;
        doc["deviceId"] = uniqueIdGetDeviceId();
        doc["counter"] = uniqueIdGetCounter();
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    };

    server.on("/id/status", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send(200, "application/json", uniqueIdBuildStatusJson());
    });

    server.on("/id/device", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        doc["status"] = "ok";
        doc["deviceId"] = uniqueIdGetDeviceId();
        doc["counter"] = uniqueIdGetCounter();
        doc["nodeName"] = nodeName;
        doc["strategy"] = "hybrid-mac-hash-time-counter-random";
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/id/next", HTTP_GET, handleUniqueIdNext);
    server.on("/id/next", HTTP_POST, handleUniqueIdNext);
#endif

    server.on("/supervisor/status", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        doc["deviceRole"] = deviceRole;
        auto supervisor = doc["supervisor"].to<JsonObject>();
        appendSupervisorStatus(supervisor);
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

