scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        auto serveBtConnectPage = [](AsyncWebServerRequest *request) {
            #ifndef FORCE_INLINE_BTCONNECT
                if (LittleFS.exists("/web/BTConnect.html")) {
                        request->send(LittleFS, "/web/BTConnect.html", "text/html");
                        return;
                }
            #endif

                static const char* kInlineBtConnectPage = R"HTML(
<!doctype html>
<html>
<head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width,initial-scale=1" />
    <title>BTConnect</title>
    <style>
        body { font-family: Segoe UI, Arial, sans-serif; margin: 16px; background: #0f172a; color: #e2e8f0; }
        h1 { margin: 0 0 12px 0; }
        .row { display: flex; gap: 8px; flex-wrap: wrap; margin-bottom: 10px; }
        button { padding: 10px 12px; border-radius: 8px; border: 1px solid #334155; background: #1e293b; color: #e2e8f0; cursor: pointer; }
        input, select { padding: 8px; border-radius: 6px; border: 1px solid #334155; background: #0b1220; color: #e2e8f0; }
        pre { background: #020617; border: 1px solid #334155; border-radius: 8px; padding: 12px; min-height: 240px; overflow: auto; }
        .hint { color: #93c5fd; margin-bottom: 10px; }
    </style>
</head>
<body>
    <h1>BTConnect</h1>
    <div class="hint">Fallback page served from firmware. For static file mode, upload LittleFS data to include /web/BTConnect.html.</div>

    <div class="row">
        <button id="discover">Discover (Audio)</button>
        <button id="targets">List Audio Targets</button>
        <button id="status">Audio Status</button>
    </div>

    <div class="row">
        <input id="address" placeholder="AA:BB:CC:DD:EE:FF" size="22" />
        <select id="transport">
            <option value="classic">classic</option>
            <option value="ble">ble</option>
        </select>
        <button id="connect">Connect</button>
        <button id="disconnect">Disconnect</button>
    </div>

    <pre id="out">Ready\n</pre>

    <script>
        const out = document.getElementById('out');
        function log(obj) {
            out.textContent = JSON.stringify(obj, null, 2) + "\n" + out.textContent;
        }
        async function post(path, body) {
            const data = new URLSearchParams(body || {});
            const res = await fetch(path, { method: 'POST', headers: { 'Content-Type': 'application/x-www-form-urlencoded' }, body: data });
            const text = await res.text();
            let parsed = text;
            try { parsed = JSON.parse(text); } catch {}
            return { ok: res.ok, status: res.status, body: parsed };
        }
        async function get(path) {
            const res = await fetch(path);
            const text = await res.text();
            let parsed = text;
            try { parsed = JSON.parse(text); } catch {}
            return { ok: res.ok, status: res.status, body: parsed };
        }

        document.getElementById('discover').onclick = async () => log(await post('/api/bluetooth-audio/discover', { duration: 10 }));
        document.getElementById('targets').onclick = async () => log(await get('/api/bluetooth-audio/targets'));
        document.getElementById('status').onclick = async () => log(await get('/api/bluetooth-audio/status'));
        document.getElementById('connect').onclick = async () => {
            const address = document.getElementById('address').value.trim();
            const transport = document.getElementById('transport').value;
            log(await post('/api/bluetooth-audio/connect', { address, transport }));
        };
        document.getElementById('disconnect').onclick = async () => log(await post('/api/bluetooth-audio/disconnect', {}));
    </script>
</body>
</html>
)HTML";

                request->send(200, "text/html", kInlineBtConnectPage);
        };

    server.on("/BTConnect", HTTP_GET, serveBtConnectPage);
    server.on("/BRConnect", HTTP_GET, serveBtConnectPage);

    server.on("/supervisor/config", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!isSupervisorRole()) {
            request->send(409, "application/json", "{\"error\":\"supervisor role required\"}");
            return;
        }

        if (request->hasParam("enabled", true)) {
            String enabled = request->getParam("enabled", true)->value();
            supervisorEnabled = parseBoolValue(enabled);
        }
        if (request->hasParam("requireFrontend", true)) {
            String requireFrontend = request->getParam("requireFrontend", true)->value();
            supervisorRequireFrontend = parseBoolValue(requireFrontend);
        }
        if (request->hasParam("intervalMs", true)) {
            const unsigned long requested = request->getParam("intervalMs", true)->value().toInt();
            if (requested >= 1000 && requested <= 120000) {
                supervisorCheckIntervalMs = requested;
            }
        }
        if (request->hasParam("backendUrl", true)) {
            supervisorBackendProbe.url = request->getParam("backendUrl", true)->value();
        }
        if (request->hasParam("frontendUrl", true)) {
            supervisorFrontendProbe.url = request->getParam("frontendUrl", true)->value();
        }
        if (request->hasParam("heartbeatUrl", true)) {
            supervisorHeartbeatUrl = request->getParam("heartbeatUrl", true)->value();
        }

        bool persist = true;
        if (request->hasParam("persist", true)) {
            persist = parseBoolValue(request->getParam("persist", true)->value());
        }
        if (persist) {
            saveSupervisorConfig();
        }

        JsonDocument doc;
        doc["updated"] = true;
        doc["persisted"] = persist;
        auto supervisor = doc["supervisor"].to<JsonObject>();
        appendSupervisorStatus(supervisor);
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    #ifndef DISABLE_BONECRUSHER
    server.on("/bonecrusher/worker/status", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        doc["role"] = deviceRole;
        doc["enabled"] = bonecrusherConfig.enabled;
        doc["queueManagerUrl"] = bonecrusherConfig.queueManagerUrl;
        doc["queueName"] = bonecrusherConfig.queueName;
        doc["workerId"] = bonecrusherConfig.workerId;
        doc["leaseMs"] = bonecrusherConfig.leaseMs;
        doc["pollIntervalMs"] = bonecrusherConfig.pollIntervalMs;
        doc["heartbeatMs"] = bonecrusherConfig.heartbeatMs;
        doc["processTimeoutMs"] = bonecrusherConfig.processTimeoutMs;
        doc["retryDelayMs"] = bonecrusherConfig.retryDelayMs;
        doc["maxAttempts"] = bonecrusherConfig.maxAttempts;

