scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    const String capabilityHash = computeNodeCapabilityHash();
    UdpAnnouncementState state = udpRuntimeGetAnnouncementState();

    if (sendNodeBeaconAnnouncement(
        udpRuntimeSocket(),
        runtimeUdpParentPort,
        nodeName.c_str(),
        deviceRole,
        capabilityHash,
        state,
        runtimeUdpParentPort,
        runtimeUdpSiblingPort)) {
        udpRuntimeApplyAnnouncementState(state);
    }
}

String getOriginFromUrl(const String& url) {
    const int scheme = url.indexOf("://");
    if (scheme < 0) return "";

    const int authorityStart = scheme + 3;
    if (authorityStart >= static_cast<int>(url.length())) return "";

    const int pathStart = url.indexOf('/', authorityStart);
    if (pathStart < 0) return url;
    return url.substring(0, pathStart);
}

bool isValidTopologyPortPair(uint16_t parentPort, uint16_t siblingPort) {
    if (parentPort < 4200) return false;
    if ((parentPort % 2) != 0) return false;
    if ((siblingPort % 2) != 1) return false;
    if (siblingPort != static_cast<uint16_t>(parentPort + 1)) return false;
    return true;
}

bool syncTopologyUdpPortsFromAggregator() {
    if (WiFi.status() != WL_CONNECTED) return false;

    const String backendOrigin = getOriginFromUrl(supervisorBackendProbe.url);
    if (backendOrigin.length() == 0) return false;

    const String localIp = WiFi.localIP().toString();
    const String topologyUrl = trimTrailingSlash(backendOrigin) + "/api/nodes";

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient topologyClient;
    if (!http.begin(topologyClient, topologyUrl)) {
#else
    if (!http.begin(topologyUrl)) {
#endif
        return false;
    }

    http.setTimeout(3000);
    const int code = http.GET();
    if (code < 200 || code >= 300) {
        http.end();
        return false;
    }

    const String body = http.getString();
    http.end();

    JsonDocument doc;
    if (deserializeJson(doc, body)) {
        return false;
    }

    if (!doc.is<JsonArray>()) {
        return false;
    }

    for (JsonObject node : doc.as<JsonArray>()) {
        const String nodeId = String(node["nodeId"] | "");
        const String nodeDisplayName = String(node["nodeName"] | "");
        const JsonVariantConst details = node["details"];
        const String nodeDetailsName = details.is<JsonObjectConst>() ? String(details["nodeName"] | "") : String();
        const String nodeIp = String(node["ip"] | "");

        const bool isSelf =
            (nodeId.length() > 0 && nodeId.equalsIgnoreCase(nodeName)) ||
            (nodeDisplayName.length() > 0 && nodeDisplayName.equalsIgnoreCase(nodeName)) ||
            (nodeDetailsName.length() > 0 && nodeDetailsName.equalsIgnoreCase(nodeName)) ||
            (nodeIp.length() > 0 && nodeIp.equals(localIp));

        if (!isSelf) continue;

        const uint16_t parentPort = static_cast<uint16_t>(node["topology"]["udp"]["parentPort"] | 0);
        const uint16_t siblingPort = static_cast<uint16_t>(node["topology"]["udp"]["siblingPort"] | 0);
        if (!isValidTopologyPortPair(parentPort, siblingPort)) {
            return false;
        }

        if (runtimeUdpParentPort != parentPort || runtimeUdpSiblingPort != siblingPort) {
            runtimeUdpParentPort = parentPort;
            runtimeUdpSiblingPort = siblingPort;
            udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort);
        }
        return true;
    }

    return false;
}

void writeDefaultDocIfMissing(const char* path, const char* content) {
    if (LittleFS.exists(path)) {
        return;
    }
    File file = LittleFS.open(path, "w");
    if (!file) {
        Serial.print("[DOCS] Failed to create ");
        Serial.println(path);
        return;
    }
    file.print(content);
    file.close();
}

void ensureDocsTreeAndDefaults() {
    if (!LittleFS.exists("/services/docs")) {
        LittleFS.mkdir("/services/docs");
    }
    if (!LittleFS.exists("/devices/docs")) {
        LittleFS.mkdir("/devices/docs");
    }

    writeDefaultDocIfMissing("/devices/docs/LEDPIN.txt", "Device: LEDPIN");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_set_output.txt", "Action: set_output");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_raise.txt", "Action: raise");
    writeDefaultDocIfMissing("/devices/docs/LEDPIN_lower.txt", "Action: lower");
    writeDefaultDocIfMissing("/devices/docs/RELAY.txt", "Device: RELAY (pin-controlled relay)");
    writeDefaultDocIfMissing("/devices/docs/RELAY_toggle.txt", "Action: toggle");
    writeDefaultDocIfMissing("/devices/docs/RELAY_turnOn.txt", "Action: turnOn");
    writeDefaultDocIfMissing("/devices/docs/RELAY_turnOff.txt", "Action: turnOff");
    writeDefaultDocIfMissing("/devices/docs/RELAY_fsm.txt", "FSM: off --turnOn--> on, on --turnOff--> off, off|on --toggle--> toggled state");

    writeDefaultDocIfMissing("/services/docs/ffs.txt", "Federated File System: provides distributed file storage and access.");
    writeDefaultDocIfMissing("/services/docs/ffs_listFiles.txt", "List all files in the file system.");
    writeDefaultDocIfMissing("/services/docs/ffs_write.txt", "Write data to a file.");
    writeDefaultDocIfMissing("/services/docs/ffs_read.txt", "Read data from a file.");
    writeDefaultDocIfMissing("/services/docs/ffs_remove.txt", "Remove a file from the file system.");
    writeDefaultDocIfMissing("/services/docs/ffs_sync.txt", "Synchronize file system to storage.");

    writeDefaultDocIfMissing("/services/docs/pmachine.txt", "PL/0-style virtual machine for executing pcode programs.");
    writeDefaultDocIfMissing("/services/docs/pmachine_loadProgram.txt", "Load a pcode program into the VM.");
    writeDefaultDocIfMissing("/services/docs/pmachine_run.txt", "Run the loaded program.");
    writeDefaultDocIfMissing("/services/docs/pmachine_singleStep.txt", "Execute a single instruction.");
    writeDefaultDocIfMissing("/services/docs/pmachine_setBreakpoint.txt", "Set a breakpoint at a given address.");
    writeDefaultDocIfMissing("/services/docs/pmachine_clearBreakpoint.txt", "Clear a breakpoint at a given address.");
    writeDefaultDocIfMissing("/services/docs/pmachine_getStatus.txt", "Get the current status of the VM.");

    writeDefaultDocIfMissing("/services/docs/sensor.txt", "Provides access to connected sensors (e.g., DHT22, BME280).");
    writeDefaultDocIfMissing("/services/docs/sensor_readSensor.txt", "Read values from a sensor.");
    writeDefaultDocIfMissing("/services/docs/sensor_resultToJson.txt", "Convert sensor result to JSON.");
}

void setup() {

